docs: update README.md to fix diagram
